[
  {
    "title": "Final Copy",
    "id": "t.aqnu5bu2ujvq",
    "archie": {
      "methodology": "<b>About the simulator:</b> We estimate odds by randomly simulating the remainder of the season thousands of times and counting how often each team makes the playoffs, gets the No. 1 seed, the No. 1 draft pick and so on. We estimate each team’s probability of winning each remaining game using a statistical forecast that incorporates a host of data, including team records, roster changes, weather, game location and more advanced measures like expected points added and success rate.",
      "credits": "By Ryan Best, David Haye, Elliot Jordan, Junghye Kim, Austin Mock, Matt Myers, Thomas Oide, Laura Pelton, Yuriko Schumacher and Oliver Viehweger",
      "note": "Adapted from The New York Times’s NFL Playoff Simulator.",
      "team_recirc_logos_hed": "All teams",
      "team_recirc_stories_hed": "More {{ team_name }} stories",
      "index_recirc_stories_hed": "More NFL playoff stories",
      "draft_recirc_stories_hed": "More NFL Draft stories",
      "header_image_alt": "NFL logo",
      "index_header": "2025 NFL Playoff Simulator:",
      "index_header_sub": "Each team’s path to the postseason",
      "index_intro_p1": "Welcome to The Athletic’s 2025 NFL Playoff Simulator, where you’ll find everything you need to know about all the ways your favorite team’s season could end, from a No. 1 playoff seed to the No. 1 pick in the 2026 NFL Draft.",
      "index_intro_p2": "The tables above represent our best guess for the final playoff picture, along with a view of the standings if the season ended today. Below, you’ll find much more detailed estimates for all 32 NFL teams. All these estimates are powered by <a href=\"https://www.nytimes.com/athletic/author/austin-mock/\">Austin Mock’s</a> NFL Projection Model. You can read more about this tool and how it works <a href=\"https://www.nytimes.com/athletic/6736840/2025/10/22/nfl-playoff-simulator-how-to-explainer-projections-odds/\">right here</a>, and send in your questions to <a href=\"mailto: askaustin@theathletic.com\">AskAustin@theathletic.com</a>.",
      "draft_header": "2026 NFL Draft:",
      "draft_header_sub": "Each team’s projected order",
      "draft_intro": "If you’re looking ahead to next season, this is the place to do it. Here are our estimates for the order of the 2026 NFL Draft, updated with each game result.",
      "sim_header": "{{ team_name }} 2025 NFL playoff chances:",
      "sim_header_sub": "Explore any outcome",
      "team_image_alt": "{{ team_name }} logo",
      "sim_p1": "<b>With {{ N }} games remaining, the {{ team_name }} have {{ percent_chance }} chance to {{ scenario }}. </b>This interactive tool is designed to help you explore which games matter most for the rest of the {{ team_name_short }}’ season. As you pick winners of games, the colors on some games will change, reflecting their relative importance. Use the dropdown below to explore other outcomes.",
      "sim_p2": "<b>The tables below represent all NFL games remaining.</b> While the {{ team_name }}’ games are typically the most important, outcomes from other games can affect the {{ team_name }}’ chances indirectly. Pick winners and explore which games matter most.",
      "details_header": "{{ team_name }} 2025 NFL playoff chances:",
      "details_header_sub": "Detailed projections",
      "sankey_hed": "End-of-season outcomes",
      "draft_pick_hed": "{{ team_name }}’ likelihood of each 2026 draft pick position",
      "possibilities_hed": "Best and worst outcomes",
      "details_p1": "Below are our estimates for the {{ team_name }}’ chances at all playoff outcomes since the beginning of the season. These figures are updated after every NFL game and occasionally when there is a player injury or other roster news.",
      "area_hed": "How the {{ team_name }}’ chances have changed",
      "details_p2": "Here you’ll find our estimates for all remaining combinations of records the {{ team_name }} may end the season with.",
      "histogram_hed": "{{ team_name }}’ likeliest end-of-season records",
      "austin_updates": [
        {
          "team": "",
          "text": "After losing to the Bills on Sunday, the Chiefs' playoff odds drop to 73%."
        },
        {
          "team": "",
          "text": "Since the start of the season, the Colts playoff odds increased by 55%."
        },
        {
          "team": "",
          "text": "After upsetting the Packers in Green Bay, the Panthers' playoff odds rose from 8% to 19%."
        },
        {
          "team": "",
          "text": "The 3-5 Texans playoff odds sit at 9% despite entering the season as the AFC South favorites."
        },
        {
          "team": "",
          "text": "Jayden Daniels left Sunday night's game with his third separate injury this season as the 3-6 Commanders have just a 1% chance to make the playoffs."
        }
      ]
    }
  },
  {
    "title": "Visual edits",
    "id": "t.yjvgpjcfobox",
    "archie": {}
  },
  {
    "title": "Copy edits",
    "id": "t.0",
    "archie": {}
  }
]