[
  {
    "title": "WR",
    "id": "t.0",
    "archie": {
      "player_id": {
        "background": "Background text here",
        "strengths": [
          "Strengths list here"
        ],
        "weaknesses": [
          "Weaknesses list here"
        ],
        "full_summary": "Full summary here",
        "tagline_sentence": "Tagline sentence here",
        "grade": "Grade here"
      },
      "tory-horton-wr": {
        "background": "Tory Horton, who is the youngest of five children (three boys, two girls), was born and raised in Fresno with his parents (Tim and Zezette). His older sister (Jeane) was an All-American volleyball player at UTEP (2009-13) and has played professional volleyball overseas in France, Germany, Italy and Peru. His older brother (Tyler) played cornerback at Boise State (2015-18) and signed with the Miami Dolphins after going undrafted in the 2019 NFL Draft (he left the team during mini-camp to pursue a career in law enforcement). Horton grew up playing several sports, including baseball (his first love), basketball (his father’s sport), football and soccer.\nHorton originally attended Edison High School where he began on JV before getting the call up to varsity late in his sophomore season. As a junior, he posted 37 receptions for 742 yards (20.1 average) and seven touchdowns, adding a rushing touchdown and passing touchdown to earn Second Team All-League honors. For his senior season, Horton transferred to Washington Union and helped the team to an 11-2 record and the 2019 league championship. He caught 37 passes for 821 yards (22.2 average) and 15 touchdowns, earning First Team All-League and Conference MVP honors in his final season. Horton played defensive back as a senior and recorded 29 tackles and four interceptions. He also lettered in baseball (outfielder and pitcher), basketball and track (jumps and relays) throughout his high school career.\nA three-star recruit, Horton was the No. 204 athlete in the 2020 recruiting class and the No. 263 recruit in the state of California. A late bloomer who played most of his senior year of high school at 16-years-old, he was “too skinny” and struggled to get noticed at recruiting camps. Horton received primarily FCS-level attention with offers from Montana, Montana State and Northern Colorado. He grew up attending Fresno State games, but the Bulldogs never offered. Late in his senior season, Nevada (and lead recruiter Eric Scott) invited him for an official visit and gave him his only FBS-level offer. After two seasons at Nevada, Horton decided to transfer to Colorado State, following Jay Norvell, who left Nevada to become CSU’s head coach prior to the 2022 season. After his productive 2022 season at Colorado State, Horton was recruited by several SEC programs (with NIL opportunities), but Horton stayed loyal to Norvell and didn’t transfer. He took advantage of the extra year of eligibility due to the pandemic and returned to Colorado State for a fifth season in 2024.",
        "strengths": [
          "Gliding speed and shows a go-and-get-it gear when the ball is in the air (22.5 in-game MPH)",
          "Can stack/separate vertically or sell double-moves",
          "Saw a healthy dose of crossers and over routes on film and has a feel for where to fit in coverage",
          "Able to flip his hips towards the ball and make smooth body adjustments or climb the ladder on throws above his line of sight",
          "Can start/stop in a blink to shake defenders after the catch and put more missed tackles on tape than expected",
          "Offers punt return value with three return touchdowns at CSU (79, 78 and 72 yards), averaging 16.3 yards per return (26/423/3)",
          "Also had a passing touchdown (5-for-6 passing in his career for 151 yards, one touchdown, one interception)",
          "Was a two-time team captain (Norvell: “I’ve been around the kid for a long time and he’s made of the right stuff.”)",
          "Set the CSU single-game record for receptions (16, vs. Colorado in 2023) and finished his career No. 2 in receiving yards (3,615) at both Colorado State and in the Mountain West Conference"
        ],
        "weaknesses": [
          "Skinny, lean-limbed frame with limited functional strength",
          "Too easily jammed, rerouted and forced off his intended path",
          "Rushes as a route-runner, which leads to drifts and disrupts timing concepts",
          "Has the footwork to snap off sharp route breaks, but cheats and rounds too often",
          "Improved his drop rate in 2023, but also put some frustrating focus drops on tape (see 2023 Utah State tape)",
          "Struggles to frame and finish the football with a crowd around him",
          "More double catches than you want to see, especially when working over the middle",
          "Willing positional blocker, but lacks sustain strength",
          "Despite a thin frame, he had stayed durable most of his career until his final season: Missed one game due to a groin strain (September 2024) before suffering a season-ending right knee injury (October 2024)."
        ],
        "full_summary": "A two-year starter at Colorado State, Horton was primarily an outside receiver (right side of the formation) in head coach Jay Norvell’s version of the air raid offense. After ranking top-five in the FBS in catches (96) and first down grabs (57) in 2023, he returned for his “super senior” season in 2024, but played in just five games due to his right knee injury and fell just 35 receiving yards shy of the Mountain West career record. However, he will continue an impressive run by CSU of producing pass-catching draft picks (following Trey McBride, Olabisi Johnson, Michael Gallup, Rashard Higgins). Horton is field fast and flashes an explosive gear on downfield and crossing routes (combined for 33 catches of 20+ yards over the 2022-23 seasons, which was seventh-most in FBS). His ball skills and route timing can be disrupted by physical defensive backs, but his vertical speed will also open up comebacks, digs and underneath runways. <strong>Overall, Horton must tighten his route-running and get stronger, but his fluidity, speed and natural tracking skills can be weaponized by the right coaching staff. He projects as a rotational Z receiver and punt returner who can gradually push for starting flanker reps.</strong>",
        "tagline_sentence": "Tagline sentence here",
        "grade": "Grade here"
      },
      "luther-burden-iii-wr": {
        "background": "Luther Burden III, who is the only boy of 10 children (eight older sisters, one younger sister), grew up in the inner-city of St. Louis in the neighborhood called “The Ville” (north St. Louis). His mother is Gaye Union. His father (Luther Jr.) was a star guard on the St. Louis University basketball team in the mid-80s (had over 1,300 career points) and had a cup of coffee with the Indiana Pacers. In May 1987, Luther Jr. was arrested for selling cocaine to an undercover police officer and he was sentenced to four years in prison (served 12 months and was on the prison basketball team). Luther Jr., who now works at a supermarket distribution center, got his life on the right track for his children and helped his son reach his athletic potential (Burden III: “My dad is my best friend.”). At the age of eight, Burden started playing football at the Wohl City Recreation Center and it became his escape from the crime and shootings in his neighborhood. He made such an impact that the coaches at Herbert Hoover Boys &amp; Girls Club asked his parents to work with him. In his first year with the program, he helped lead the team to the league Super Bowl championship as a running back and defensive back (where he received the nickname “Touchdown Burden”). Starting at the age of nine, Burden was a standout basketball and football player at Herbert Hoover all the way through middle school (moved to wide receiver in the fifth-grade).\nBurden originally attended Cardinal Ritter College Prep, a private Catholic high school in St. Louis. As a freshman, he paired with senior wide receiver Jameson Williams (2023 first-round pick of the Detroit Lions) to create a dynamic receiver tandem and caught 15 touchdown passes. The duo led the program to a 16-1 record with the only loss coming in the 2018 Class 3 state championship game (Williams calls Burden his “little brother”). Burden was in the midst of another productive season as a sophomore until the season was cancelled in October 2019 after seven games due to an ineligible player (coaches were also fired). Due to the pandemic, Cardinal Ritter played an abbreviated schedule in fall 2020 and Burden finished with 35 catches for 747 yards and five touchdowns. After his junior season, Burden transferred to football powerhouse East St. Louis High School (across the river in Illinois) in January 2021, primarily so he could graduate early and enroll in college. He finished his three high school seasons at Cardinal Ritter with 124 receptions for 2,941 yards and 39 touchdowns. As a senior, Burden earned all-american and all-state honors and led the team to an 11-3 record and the 2021 6A state championship game (lost to Cary-Grove, 37-36). He was named the all-metro offensive player of the year and finished his final season with 71 catches for 1,174 yards and 20 touchdowns, adding eight punt return touchdowns and a 54-yard rushing touchdown. Burden was also tabbed as a top-flight basketball player in middle school and led Cardinal Ritter to the 2019-20 Class 3 state basketball championship as a sophomore (didn’t play basketball his final two years of high school).\nA five-star recruit, Burden was the No. 1 wide receiver in the 2022 recruiting class and the No. 1 recruit in the state of Illinois. He was the No. 3 overall recruit nationally behind only athlete Travis Hunter and defensive tackle Walter Nolen. He also had double-digit basketball offers and his coaches believed he could have played professional basketball if he went that route. With his prolific freshman season, FBS programs didn’t wait long making aggressive offers. Missouri was his first offer in October 2018 and he collected over 20 offers before the start of his sophomore year, including offers from Georgia, LSU, Oregon, Tennessee, USC and others. Burden’s final five was Alabama, Georgia, Missouri, Ohio State and Oklahoma and he committed to Lincoln Riley and the Sooners in October 2020. He stayed committed for 10 months until deciding to decommit from Oklahoma in August 2021. Two months later, Burden officially announced he would be staying close to home and committed to head coach Eli Drinkwitz and Missouri. He was the No. 1 recruit in the Tigers’ 2022 class and became just the third consensus five-star recruit in program history. Burden opted out of the 2024 bowl game and skipped his senior season to enter the 2025 NFL Draft.",
        "strengths": [
          "Above average foot speed for a 210-pounder",
          "Dangerous with the ball in his hands and runs with the physicality and contact balance of a running back",
          "Lined up in the backfield and threatened defenses with jet-sweep options",
          "Saw a high-volume of quick targets and runway routes to give him catch-and-run chances (7.3 YAC per reception over his career)",
          "Outstanding lower body agility to redirect and burst in another direction",
          "Has the ability to stop on a dime and leave defenders falling over themselves (78 forced missed tackles in his career)",
          "Strong concentration and control at the catch point",
          "Tracks well over his shoulder to coast underneath the pass",
          "Doesn’t appear bothered with crowded air space downfield",
          "Flashes play strength to fight through contact and back to the ball",
          "Averaged 10.5 yards per punt return (23/242/1) in his career with a 78-yard touchdown as a freshman",
          "Caught a pass in 34 straight games, which is the second-longest streak in school history",
          "Didn’t miss a game due to injury in his three college seasons",
          "Finished his career No. 4 in Missouri history in career catches (192)"
        ],
        "weaknesses": [
          "Only 10 catches of 20+ yards in 2024 (ranked 110th in the FBS in 2024)",
          "Upright route-running gives defenders a clear target to redirect or latch on",
          "Needs to clean up his footwork for better snap at the top of routes",
          "Looks disinterested on some routes",
          "Fumbled on the 2024 Boston College tape and muffed one punt in each of his three college seasons",
          "More of a get-in-the-way blocker and doesn’t consistently latch-and-control defenders",
          "Drew two frustrating 15-yard penalties on the 2024 Boston College tape, including throwing an opponent’s mouthguard in frustration (Burden: “I have to cut the nonsense out.”)",
          "Below average production in 2024"
        ],
        "full_summary": "A three-year starter at Missouri, Burden was predominantly a slot receiver in offensive coordinator Kirby Moore’s motion-heavy scheme (85.3% of his 2024 snaps came in the slot). With only one 100-yard receiving performance in 2024, he wasn’t able to build on his All-American sophomore season in his final year as the entire Missouri offense struggled, but there were enough flashes to tease his high-level talent. With his run-after-catch skills, Burden saw a high-volume of quick-hitters and crossers to showcase his any-direction burst and physicality to give defenders the shake. His route-running is best described as a “work-in-progress” right now, but he appears unfazed when forced to flip his body and track/adjust to errant throws. <strong>Overall, Burden is still working on his undergrad degree in route set up and separation, but he holds a master’s degree in creating with the ball in his hands due to his explosive speed and competitive toughness. For an NFL team targeting a YAC weapon with upside to be more, he will be an appealing option early in the draft.</strong>",
        "tagline_sentence": "Tagline sentence here",
        "grade": "Grade here"
      }
    }
  }
]