[
  {
    "title": "Template",
    "id": "t.0",
    "archie": {
      "player_id": {
        "background": "",
        "strengths": [
          ""
        ],
        "weaknesses": [
          ""
        ],
        "full_summary": "",
        "tagline_sentence": "",
        "grade": ""
      }
    }
  },
  {
    "title": "Centers",
    "id": "t.ahe06ahas4ug",
    "archie": {}
  },
  {
    "title": "Cornerbacks",
    "id": "t.8t2zewton9b7",
    "archie": {
      "will-johnson": {
        "background": "William “Will” Johnson, who is the youngest of two children, was born and raised in Detroit with his father (Deon) and mother (Kafi Kumasi). Deon, who is now a coach and co-founder of Sound Mind Sound Body youth football organization, was a defensive back at Michigan (1990-94) and was part of three Big Ten Championships. Johnson’s older sister (Kayli) was on the track and field team (indoor and outdoor) at Michigan State (2016-20) and Texas Tech (2021-22), earning All-American status and winning a Big 12 shot put title (58’5” – personal-best). After stints with the Detroit Lions and Rutgers, she was hired by Michigan football in March 2024 to be the director of campus recruiting. With Sound Mind Sound Body, Johnson grew up in environments that put his football skills on a fast trajectory. He started training at a young age with his father, as well as specialists like speed trainer Johnie Drake. Throughout youth football, he played multiple positions and often played up a grade level or two in competition. Johnson later played for the 7-on-7 team Max Ex.\nJohnson enrolled at Grosse Pointe South High School where he became the first four-year varsity starter in school history. He was an impact player on all phases as a wide receiver, cornerback and return man while also playing wildcat quarterback. Johnson helped the team to a combined 15 wins over his first two seasons, including back-to-back league titles. As a junior, he accounted for 21 tackles and eight pass break-ups in an abbreviated schedule due to the pandemic, adding 37 catches for 600 yards and eight touchdowns (also had a punt return touchdown). As a senior, Johnson finished with 45 tackles, 12 pass break-ups, 3.5 tackles for loss, 1.0 sack and one interception, earning all-state honors. He also posted 42 receptions for 667 yards and six touchdowns in 2021 with 1,302 all-purpose yards with one punt return touchdown. Johnson also lettered in basketball at Grosse Pointe South.\nA five-star recruit, Johnson was the No. 3 cornerback in the 2022 recruiting class and the No. 1 recruit in the state of Michigan. He was the No. 15 overall player nationally. Growing up in a Wolverines’ household, Johnson was introduced to Michigan football at a young age and regularly attended The Big House, but it wasn’t a foregone conclusion that he would end up in Ann Arbor. After receiving his first scholarship offer (Southern Miss) during his freshman season, the recruiting floodgates opened with offers from Alabama, Florida, LSU, Notre Dame and several top programs. After taking visits to Columbus and Los Angeles, Johnson narrowed his decision to Michigan, Ohio State and USC, but the chance to stay close to home and continue his family’s legacy led him to Ann Arbor. He was the No. 1 ranked recruit in Jim Harbaugh’s 2022 class and enrolled early. Johnson opted out of the 2024 bowl game and skipped his senior season to enter the 2025 NFL Draft.",
        "strengths": [
          "Fluid, long athlete with the size to match up with bigger pass-catchers",
          "Clean footwork is the foundation for his smooth click-and-close",
          "Quickly identifies route leverage to maintain phase out of breaks",
          "Great anticipation to key, read and drive from off-coverage (set the Michigan career-record with three pick-six touchdowns)",
          "His receiver background shows when he has a chance at the ball",
          "Shows the coverage awareness to stay connected to multiple routes in zone",
          "Stays patient and balanced through his early jam and fights back against push-offs at the top of routes",
          "Physical tackler near the sideline and guards the sticks",
          "Quiet, business-like demeanor",
          "Requested the No. 2 jersey (same as Charles Woodson) for “extra motivation” to be great"
        ],
        "weaknesses": [
          "Average speed for the position by NFL standards",
          "Opposing quarterbacks know they can bait him on double-moves",
          "Panics at times once his back to the ball (late pass interference on 2024 Washington tape sealed the Huskies’ win)",
          "Made some business decisions and put poor tackling attempts on his 2024 film",
          "Doesn’t consistently wrap and strike through when he does throw his body around",
          "Only 4.4% of his college snaps came inside vs. the slot",
          "Battled several injuries the past two seasons: After dealing with discomfort in his right knee “for a while,” he underwent surgery (“minor scope”) following the 2022 season, which sidelined him for two games to start the 2023 season; Sat out the 2023 Big Ten Championship game after a minor injury; Missed seven games as a junior – one due to a shoulder issue (September 2024) and the final six games with a toe injury (October 2024)"
        ],
        "full_summary": "A three-year starter at Michigan, Johnson was an outside cornerback in defensive coordinator Wink Martindale’s zone-heavy scheme (only 14.8% of his coverage snaps came in man-to-man in 2024). After an All-American sophomore season, including Defensive MVP honors in the National Title Game, he put up-and-down play on his 2024 tape before missing most of his final season due to injuries. Johnson is comfortable in both press and off-coverage with the fluid athleticism and route recognition to seamlessly transition or attack the football. He isn’t shy getting physical at the top of routes and in pursuit, but his tackling mechanics and execution need work. <strong>Overall, Johnson is more “good” than “great” in terms of twitch and speed, but he has outstanding eyes, feet and coverage IQ to match and make plays on the football. He projects as a day one starting outside cornerback in the NFL.</strong>",
        "tagline_sentence": "",
        "grade": ""
      }
    }
  },
  {
    "title": "Defensive Tackles",
    "id": "t.iyhxr01o9izg",
    "archie": {
      "mason-graham-dt": {
        "background": "Mason Graham, who has one older sister (Taylor) and two younger brothers (Landon and Carson), was born and raised in southern California with his parents (Allen and Kimberly). He started playing organized sports at the age of four, starting with soccer and then basketball, baseball, football, rugby and among others. At the Pop Warner level, Graham starred at running back and linebacker for the Santa Margarita Titans and Eagles and often played up one or two grade levels due to his size. He continued playing basketball through middle school and was named the team MVP of his junior high team. Graham also played club rugby for eight years in middle and high school (played for the Back Bay, Rhinos and Raptors). After he graduated high school, his parents and younger brothers relocated to the north shore of Oahu, Hawaii (his older sister graduated from Arizona in 2023).\nGraham attended Servite High School, an all-boys prep school in Anaheim that produced several NFL players like cornerback Trent McDuffie, Ryan Kalil, Matt Kalil and others. He enrolled as a 6-foot-1, 215-pound linebacker, but was (reluctantly) moved to the defensive line and all of Servite’s players go both ways so he also played at offensive tackle. After playing JV as a freshman (Servite freshman aren’t allowed to play varsity), Graham moved up to varsity as a sophomore and became a starter, posting 34 tackles and 2.0 sacks. Servite’s fall football schedule in 2020 was pushed to the spring of 2021 due to COVID and Graham finished with nine tackles and 2.0 sacks as a junior. He had his best season as a senior with 60 tackles, 22.0 tackles for loss and 14.0 sacks as he was named the player of the year by the L.A. Times and most valuable lineman in the conference. Graham helped the team to a 10-3 finish, losing to the eventual 2021 state champions Mater Dei in the state playoffs. Servite’s 2021 team also included high-profile recruits like wide receiver Tetairoa McMillan, tight end Keyan Burnett, quarterback Noah Fifita, and linebacker Jacob Manu (all four signed with Arizona in the 2022 recruiting class). As a freshman and sophomore, Graham played both basketball and track, setting personal-bests in the shot put (41’4”) and discus (107’5”). He also joined the wrestling team as a freshman and would have been a high-profile wrestling recruit if football wasn’t an option (Cal and Stanford inquired about him and Colorado-Mesa asked him to play both sports). Graham won two heavyweight Trinity League Championships and qualified for states.\nA four-star recruit, Graham was the No. 32 defensive lineman in the 2022 recruiting class and the No. 19 recruit in the state of California (he was the No. 3 ranked recruit from Servite behind McMillan and Burnett). A late bloomer on the recruiting trail, he received his first offer as a 280-pound junior in November 2020 from Fresno State and head coach Kalen DeBoer and director of player personnel Courtney Morgan. During the spring season in 2021, Graham added offers from Army, Boise State, Colorado State, San Jose State, Utah State and Oregon State, which was his lone offer from a power conference. After an official visit, he committed to Boise State in July 2021. However, Graham blew up as a senior and picked up an offer from Michigan (and Morgan, who moved over to the Wolverines, his alma mater) just two games into the 2021 season. Within a few weeks, Graham visited Ann Arbor and flipped his commitment to Michigan. His dream school growing up was UCLA, but they never offered him a scholarship. Several other programs entered the mix like Oregon and USC and he considered staying home and becoming a Trojan, especially after defensive line coach Shaun Nua left Michigan in January 2022 to join Lincoln Riley’s staff. But Graham was already enrolled in classes and stayed loyal to Michigan. He was the No. 7 ranked recruit in former head coach Jim Harbaugh’s 2022 class. Graham started training with pass rush trainer Javon Gopie (also known as “sack sensei”) prior to the 2024 season. Graham became best friends and roommates with Kenneth Grant at Michigan. He opted out of the 2024 bowl game and skipped his senior year to enter the 2025 NFL Draft.",
        "strengths": [
          "Thick, square build with naturally low pads to win the leverage battle",
          "Strong at the point of attack with above average instincts vs. the run",
          "Explosive by nature to fire off the ball and drive opponents into the lap of the quarterback",
          "Quick feet and hands as a pass rusher to cross the face of blockers, win half-man and knife into the backfield",
          "His agile athleticism is evident on stunts and loops",
          "Twitchy in his upper half for strong push-pulls and understands how to dismantle the balance of blockers",
          "Moves well laterally with the relentless effort to consistently make plays away from his starting point",
          "Missed tackles were hard to find on his 2024 film",
          "Blocked a field goal on the 2024 Washington tape",
          "Calls out blocking schemes pre-snap and his football IQ has jumped each season",
          "Low-key personality off the field, but violent competitor on the field",
          "Played five different sports in high school, which has helped unlock his physical abilities"
        ],
        "weaknesses": [
          "Average arm length and doesn’t always create clear separation after his initial punch",
          "NFL scouts say there is some sloppy weight on his frame",
          "His anchor breaks down vs. double-teams and redirect blocks",
          "Inconsistent sifting through traffic",
          "Needs to add more variety to his pass rush attack",
          "Broke his left thumb as a junior (September 2023) and required surgery, but only missed two weeks and returned with a club on his left hand"
        ],
        "full_summary": "",
        "</strong>": "end",
        "tagline_sentence": "",
        "grade": ""
      },
      "deone-walker-dt": {
        "background": "Deone (dee-ON) Walker, who has one sister (Nikita), was born and raised in Detroit with his parents (Deone Sr. and Sanquanetta). Eager to play football, he joined the Giants in the Detroit Police Athletic League at the age of five (with his older nephew), but wasn’t allowed to compete in games until the age of seven. Walker played a little bit of quarterback early on, but was primarily in the trenches throughout youth football due to his size. He later played for the Raiders and Ducks and lined up on both sides of the ball through middle school. He was also active in bowling and track throughout his childhood, but basketball was his “first love.”\nWalker attended Detroit’s Cass Technical High School, which has produced numerous NFL Draft picks, including current pros like offensive lineman Michael Onwenu and cornerback Jourdan Lewis. He played his freshman year on the JV team before a late call up to varsity. As a sophomore, Walker, who hit a growth spurt and grew six inches after his freshman year, became a varsity starter and played both ways as a defensive tackle and offensive tackle. He helped Cass Tech to a 12-2 record as a junior and the 2020 league championship. As a senior, Walker earned first team all-state honors with 43 tackles, 15.0 tackles for loss and 6.0 sacks over seven games. He was also a center on the Cass Tech basketball team and joined the track team, setting personal-bests in the shot put (44’3”) and discus (94’1”) as a junior.\nA four-star recruit, Walker was the No. 36 defensive lineman in the 2022 recruiting class and the No. 6 recruit in the state of Michigan. Despite very little varsity experience, he received his first scholarship offer from Bowling Green after his freshman year in June 2019. The following summer, Walker picked up a coveted offer from Michigan followed by Michigan State, Pitt and Toledo. After his junior season, he hit the road and visited several SEC programs, which resulted in offers from Florida, Georgia, Kentucky, LSU, Tennessee and others. His father was hoping he would choose Georgia or Michigan, but Walker’s connection with head coach Mark Stoops and defensive line coach Anwar Stewart led him to Kentucky. He was the No. 6 ranked recruit in the Wildcats’ 2022 class. After three seasons, Walker opted out of the 2024 bowl game and declared for the 2025 NFL Draft.",
        "strengths": [
          "Rare height/weight/length combination and blocks out the sun with sheer size",
          "Light, bouncy feet and carries his weight uncommonly well (wears wide receiver cleats because they are lighter)",
          "Gets off the ball quicker than you expect to maneuver through gaps",
          "Has a basketball background and still uses the hardcourt for his conditioning",
          "Athletic enough to drop, loop or move around the defensive front",
          "There are examples on tape of him owning the point of attack",
          "Has the upper body strength to turn, dump or displace blockers when he wants to",
          "Naturally left-handed and uses both hands well to swat the reach of blockers",
          "Uses his pterodactyl wingspan to expand his tackling radius and pull in or clothesline ball carriers",
          "Achieved his goal of becoming a team captain as a sophomore (and as a junior in 2024)",
          "Played through minor injuries and the only game he missed in college was against FCS-level Murray State in 2024"
        ],
        "weaknesses": [
          "Top-heavy body type with leaner legs and extra weight in his midsection",
          "His taller pad-level can bring his downhill momentum to a screeching halt",
          "Needs to add more thought and process to his pass rush approach",
          "Barrels into the backfield and late to break down or react to the evading/climbing quarterback",
          "Three offsides penalties in 2024",
          "Needs to keep his feet underneath him while engaged",
          "Maintaining a lower, consistent weight must be a priority for him in the NFL",
          "More examples than you want of him coasting on tape due to fatigue (averaged 52.8 defensive snaps per game over the past two seasons)"
        ],
        "full_summary": "A three-year starter at Kentucky, Walker was an interchangeable defensive lineman in defensive coordinator Brad White’s scheme (45.7% of his 2024 snaps came as a 3-technique, 26.3% as a 1-technique/nose, 25.0% head up or outside of the offensive tackle). After earning preliminary first-round grades from scouts as a sophomore, his junior season wasn’t nearly as dominant or consistent (his pressures created dropped from 51 in 2023 to 21 in 2024). A passionate basketball player through high school, Walker certainly benefits from the planet theory – there are only so many humans walking the earth who have his combination of size, strength and sweet feet. While he doesn’t play stiff, there are sloppy elements of his game that must improve for him to streamline his ability to stack, shed and finish. <strong>Overall, Walker is a unique athlete with impressive balance and movement skills for a </strong><strong>340+ pounder</strong><strong>, but his technique and pad level must catch up with his physical talent for the flashes to become consistency. If he buys into pro coaching, he has the skill set to become an NFL starter.</strong>",
        "tagline_sentence": "",
        "grade": ""
      }
    }
  },
  {
    "title": "Edge Rushers",
    "id": "t.dcmhyvm4a5r9",
    "archie": {
      "landon-jackson-edge": {
        "background": "Landon Jackson, who is one of five children, was born and raised in Texarkana (near the Texas-Arkansas border) and is close with both his mother (Katie Peek) and father (Larry Jackson). Katie played college volleyball at McNeese State and redshirted her sophomore year while she was pregnant with Landon. Larry, who stands 6-feet-11, played basketball at Texas A&amp;M (1998-2001) before transferring to McNeese State (2001-03) where he met Katie. Larry played professionally in Germany and is now an engineering technician. Landon’s younger brother (Lance) is a five-star defensive line recruit in the 2025 class and signed with Texas. His older brother played junior college basketball. At the age of four, Landon was diagnosed with Alopecia, an autoimmune disease that causes hair loss. He is open about his struggles being bullied growing up and now serves as an advocate for kids battling the disease. Jackson played every sport he could throughout his childhood, including baseball, basketball and soccer. He started playing football at the age of seven and played up a grade or two due to his size and because that’s what his older brother did. In the fifth-grade, he moved to Gilmer, Texas with his mother, but returned  to Texarkana and moved in with his father prior to eighth-grade for better football opportunities in the Pleasant Grove school district. He was also active on the AAU circuit in basketball (his “first love”) throughout middle and high school.\nJackson enrolled at Pleasant Grove High School where he was a four-year varsity letterman on the defensive line. As a freshman, he was named the district newcomer of the year with 98 tackles, 11.5 sacks, three forced fumbles and one interception. He helped the program to an undefeated 16-0 record, including the 2017 4A Division-II state title (first championship in school history). Jackson earned first team all-district honors as a sophomore with 15.0 tackles for loss and 6.0 sacks despite missing the final seven games of the season due to an ACL injury. As a junior, he led Pleasant Grove to a 15-1 record and the 2019 state championship and was named the 4A Texas Defensive Player of the Year with 17.0 sacks. His senior season was cut short due to a broken ankle and he finished his prep career with 45.0 sacks. He played both ways as a tight end on offense as well (seven catches for seven touchdowns in 2020). Jackson was also known for his dunks on the Pleasant Grove basketball team (started dunking in the seventh-grade).\nA four-star recruit, Jackson was the No. 8 edge defender in the 2021 recruiting class and the No. 19 recruit in the state of Texas. He was part of a Pleasant Grove graduating class that included several other FBS recruits, including Nick Martin (Oklahoma State) and Marcus Burris Jr. (Texas A&amp;M before transferring to Indiana). Jackson received his first scholarship offer from Texas A&amp;M in January 2018 after his breakout freshman season. Over the next few years, he collected over 30 FBS offers and narrowed it down to Alabama, Arkansas, LSU, Miami, Nebraska, Notre Dame, Oklahoma, Texas, Texas A&amp;M and Washington. A few months after LSU won the National Championship, Jackson committed to head coach Ed Orgeron in April 2020. He was the No. 10 ranked recruit in LSU’s 2021 class (two spots ahead of wide receiver Malik Nabers) and graduated early. After an injury-riddled freshman season in Baton Rouge (and turnover on the LSU coaching staff), Jackson entered the transfer portal and rebuffed a lot of calls from other schools because he knew he wanted to play at Arkansas, a program close to home that he strongly considered in high school (grew up a Razorbacks’ fan). He opted out of the 2024 bowl game and accepted his invitation to the 2025 Senior Bowl.",
        "strengths": [
          "Imposing size with a humongous wingspan due to his wide shoulders",
          "Uses his long strides to gain depth and physical swipes to grease the corner",
          "Most effective move is an outside euro step with cross-chop action to win the corner (see his reps vs. LSU LT Will Campbell)",
          "Power packed with the tenacious hands to tear through bodies",
          "Outstanding backfield vision and activity level to retrace when the quarterback climbs",
          "Above average run awareness and always looking to rally to the ball",
          "Drops his pads and explodes through the ball carrier as a tackler",
          "Blocked a pair of field goals over the last three seasons",
          "Naturally slim (was 235 pounds in 2022) and added 45+ pounds between his sophomore and junior years, developing his muscle mass and changing his diet",
          "Two-year team captain and is a positive influence in the building (NFL scout: “I love how he doesn’t get obsessed with his own stats…just wants to win and impact the game.”)"
        ],
        "weaknesses": [
          "High-cut and stiff in his lower half",
          "Body tightness diminishes his ability to drop his hips and bend the arc",
          "His lack of fluidity is highlighted on stunts and loops, giving blockers a chance to regroup",
          "His speed-to-power conversions will stall at times due to his upright stature",
          "His counter moves remain a work-in-progress",
          "Taller pad level leads to anchor issues vs. drive blocks in the run game",
          "Leggy and late to break down in small areas, leading to missed tackles in the backfield",
          "Tardy read-react on zone-read exchanges",
          "Had a foolish roughing the passer penalty on 2024 Texas A&amp;M tape",
          "Suffered two season-ending injuries in high school with an ACL injury in 2018 and broken ankle in 2020; Retore the ACL after arriving at LSU, which limited him during the 2021 season and required surgery (sat out 2022 spring practices at Arkansas)",
          "Suffered a neck injury in his final college game (November 2024) and was carted off the field and taken to a nearby hospital for precautionary reasons"
        ],
        "full_summary": "A three-year starter at Arkansas, Jackson was the “Buck” end in defensive coordinator Travis Williams’ four-man front (94.6% of his snaps came over or outside the offensive tackle in 2024). After starting his college career at LSU, he became the first Razorback to lead the defense in tackles for loss and sacks in back-to-back seasons in almost 30 years (Steven Conley in 1994-95). With his athletic, broad-shouldered physique, Jackson has NFL size and attacks blocks with physical hands and active feet to shock-and-separate from contact. His tall pads and lower body stiffness will create occasional issues setting the edge and diminish his ability to counter when his first move is ineffective, but he maintains his vision to the football to clean up plays and constantly be around the action. <strong>Overall, Jackson has a different type of pass-rushing skill set because he isn’t a super-fluid athlete, but his raw power, strength in his hands and consistent effort make him effective. He should be expected to compete for starter-level snaps during his rookie season.</strong>",
        "tagline_sentence": "",
        "grade": ""
      }
    }
  },
  {
    "title": "Guards",
    "id": "t.dzxv64s0y4kc",
    "archie": {}
  },
  {
    "title": "Linebackers",
    "id": "t.bxxtpj2y0j66",
    "archie": {}
  },
  {
    "title": "Offensive Tackles",
    "id": "t.y6p3ikbtax1l",
    "archie": {
      "will-campbell-ot": {
        "background": "William “Will” Campbell, who is the oldest of two boys, was born and raised in Monroe in northern Louisiana with his parents (Brian and Holly), who are both Monroe natives. Brian (also known as “Bull”), who is an agricultural farmer and sells seed and chemicals, played offensive line at Neville and collegiately at East Texas State (now known as Texas A&amp;M Commerce). Holly works at the family’s sporting goods store, H. Mickel Sports, which opened in 1937 and has been in the family for four generations. Growing up, Will was always a multi-sport athlete and played soccer and baseball throughout his childhood. But he gravitated towards football since before kindergarten, initially as a fullback and defensive end in youth football before his size pushed him to the offensive line (his birth certificate was needed on more than one occasion to prove his age). Aside from football, hunting was Campbell’s primary activity growing up and he took down his first deer at the age of five (there are multiple deer heads mounted on his childhood bedroom walls). His younger brother (Thomas) played tight end at Neville and signed with FCS-level Nicholls State in the 2025 recruiting class.\nLike his parents, Campbell attended Neville High School and became a four-year starter on the offensive line. As a 14-year-old freshman, he started out on the freshman team before the varsity coaches called him up in week two due to an injury at right tackle. Campbell played so well that the coaches couldn’t take him off the field as Neville won the 2017 district title. He moved to left tackle as a sophomore where he started for the rest of high school. Campbell helped Neville to a 10-win season before falling in the semifinals of the 2018 4A state playoffs. As a junior, he earned all-state honors and led Neville to another 10-win season in 2019. For his senior year, Campbell led Neville to a fourth-straight district title and was named all-state and Under Armour All-American honors. Campbell, who started playing AAU basketball in the eighth grade, also lettered in basketball all four seasons at Neville.\nA four-star recruit, Campbell was the No. 4 offensive tackle in the 2022 recruiting class and the No. 2 recruit in the state of Louisiana. He was the No. 36 recruit overall in the national rankings. After his sophomore season at Neville, Campbell started to hear from the in-state programs – his first offer was from nearby Louisiana-Monroe followed by Louisiana Tech and Louisiana Lafayette. He attended a few camps in Baton Rouge and received an offer from head coach Ed Orgeron in the midst of LSU’s 2019 National Title run. A wave of national offers soon followed, including Alabama, Auburn, Florida, Georgia, Texas and several others. Campbell went through the process and even considered Oklahoma, but he grew up in an LSU family and always knew he would end up in Baton Rouge, committing to the Tigers following his junior season. After Orgeron was fired midway through the 2021 season, Campbell stayed committed to new head coach Brian Kelly, who offered him while he was at Notre Dame. He was the No. 3 ranked recruit (Harold Perkins was No. 1) in Kelly’s first recruiting class at LSU. Campbell became the highest-ranked Louisiana offensive tackle to enroll at LSU since La’el Collins (2011). Campbell has hosted several events to promote the Tarver Braddock Foundation, which honors his cousin and close friend who passed away at the age of 16 in January 2024 in a campfire accident. Campbell was named to the SEC Academic Honor Roll in 2023. He opted out of the 2024 bowl game and skipped his senior season to enter the 2025 NFL Draft.",
        "strengths": [
          "Moves with the athletic body control to stay balanced mid-slide and through engagement",
          "Agile lateral footwork to ride rushers wide of the pocket",
          "Stays controlled and patient vs. dynamic pass rushers",
          "Impressive recovery skills to maintain leverage and stay connected",
          "Mechanically-sound process to gradually anchor vs. power",
          "Plays with purposeful inside hands and gets a fistful of jersey to control his man",
          "Makes it look easy on combination blocks",
          "Comfortably handles games (stunts, loops, etc.) regardless of the space given to him",
          "LSU offense used him much more as a puller in 2024, taking advantage of his nimble movements and decisive eyes to pick off defenders",
          "Flips a switch on the field and prides himself on playing nasty",
          "Wired to block through the whistle (his high school coaches say he had a hard time avoiding flags because of his aggressive play style)",
          "Relentless worker and was named a team captain as a sophomore and junior (Brian Kelly: “When he speaks, people really listen.”)",
          "Became the first offensive or defensive lineman to be awarded LSU’s coveted No. 7 jersey (still wore No. 66 on game day due to SEC rules)",
          "Never missed a game due to injury, starting 38 straight games at left tackle",
          "LSU’s first Consensus All-American on the offensive line since 2004"
        ],
        "weaknesses": [
          "Average arm length and can do a better job compensating for his lack of inches",
          "Falls behind if his punch",
          "Doesn’t have much margin for error if his punch extension is mistimed",
          "Slight stiffness in his lower half shows up when reacting to inside moves",
          "Routinely able to recover after being driven backwards, but NFL-level leveraged power will bring new challenges",
          "His penalties increased from one (2022) to five (2023) to nine (2024), including seven false start flags in his final season",
          "Was a left tackle only in college and doesn’t offer experience on the right side or on the interior"
        ],
        "full_summary": "A three-year starter at LSU, Campbell was a mainstay at left tackle in offensive coordinator Joe Sloan’s pass-happy, inside-outside zone scheme. He took the starting reps at left tackle from the first day of training camp as a freshman and started 38 straight games, allowing only one sack over his final 30 games with the Tigers (awarded the 2024 SEC’s Jacobs Blocking Trophy). He grew up modeling his game after Andrew Whitworth, a fellow West Monroe native, and was awarded the No. 7 jersey prior to the 2023 and 2024 seasons, which is given to LSU’s most electric playmaker (the tradition started in 2008 with Patrick Peterson). Campbell stays balanced in pass protection due to his weight distribution and controlled technique, although he can do a better job protecting vs. inside/counter moves (see his reps vs. Kyle Kennard on the 2024 South Carolina tape). He plays rugged in the run game and offers the body fluidity and explosive power to torque and displace defenders. <strong>Overall, Campbell’s mediocre arm length lessens his margin for error, but his athletic movements, core strength and competitive finish help him stay connected through the whistle regardless of the block required. His skill set is reminiscent of a more powerful version of Colts left tackle Bernhard Raimann, although some NFL teams project him best as an interior blocker.</strong>",
        "tagline_sentence": "",
        "grade": ""
      },
      "armand-membou-ot": {
        "background": "Armand Membou (MEM-boo) grew up in the Kansas City area with his mother (Annie Melong) and father (Suffo). His parents immigrated to the United States from the Central African country Cameroon and he was raised in a French-speaking household. Membou grew up playing multiple different sports, including basketball, soccer, tennis and wrestling. He decided to give organized football a chance in the eighth-grade, but was relegated to the middle school “B” team as a back-up.<br>\nMembou enrolled at Lee’s Summit North High School, the same program that produced quarterback Drew Lock and pass rusher Felix Anudike-Uzomah. Undersized and not on the radar of the varsity coaching staff, Membou played on the freshman team in year one. The next year, he was primarily a back-up on the JV squad and gradually saw more playing time throughout his sophomore season. Prior to his junior season, he hit a growth spurt, added weight and invested himself in the weight room during the COVID pandemic, becoming almost unrecognizable when he returned to the team. Membou started every game at left guard on varsity as a junior and showed substantial improvements with each game, which earned him 2020 first team all-district and all-conference honors. As a senior, he moved out to right tackle and helped Lee’s Summit to an 11-2 record and a spot in the 2021 state playoff semifinals. Membou earned first team all-state, all-district and all-conference honors in his final season.\nA three-star recruit, Membou was the No. 21 interior offensive lineman in the 2022 recruiting class and the No. 10 recruit in the state of Missouri. After becoming a varsity starter as a junior, he played next to Cayden Green, who was a top-100 recruit, and started to attract recruiting attention of his own. Within a month of his first varsity snaps, Membou picked up four major offers from Iowa State, Kansas, Kansas State and Missouri. He later added offers from Arkansas, Nebraska and Oregon, but he built a strong relationship with the Missouri coaches and was drawn to the opportunity of playing close to home. Membou was the No. 7 ranked recruit in the Tigers’ 2022 class. After three seasons, he elected to opt out of the 2024 bowl game and skip his senior year to enter the 2025 NFL Draft.",
        "strengths": [
          "Tremendous body control in his movements",
          "Explosive out of his stance to quickly set up shop",
          "Equally agile and patience in pass pro to avoid oversetting",
          "His punch is sharp and generally well-timed, which strengthens his anchor",
          "Mixes up his hand strikes with good length to keep rushers at bay",
          "Has the drive power to wash or take edge defenders for a ride in the run game",
          "Redirects cleanly and always looking for work",
          "Will finish defenders into the ground and flashes a nasty demeanor",
          "Durable and finished his college career with 30 straight starts"
        ],
        "weaknesses": [
          "Only average height by NFL standards",
          "Speed-to-power moves can take him by surprise and needs to stay alert",
          "His hands and elbows tend to start wide",
          "Only penalized three times for holding in 2024, but often gets a fistful of cloth",
          "Doesn’t have any college experience at left tackle or on the interior (only played right tackle and unbalanced tight end at Mizzou)"
        ],
        "full_summary": "A three-year starter at Missouri, Membou was a stalwart at right tackle in offensive coordinator Kirby Moore’s RPO-heavy zone scheme. Late to the game of football, he blossomed after arriving in Columbia and once he broke into the starting line-up as a freshman, he didn’t give the job back and earned All-SEC honors in 2024. As a pass blocker, Membou displays above average balance, quickness and a jolting punch in his sets to mirror up-and-down the arc. He was equally effective in the run game with the Missouri offense often running it behind No. 79 and his drive power. <strong>Overall, Membou might not have ideal height for tackle, but he plays long with exceptional control and finishing skills. His tools remind me of Troy Fautanu from the 2024 draft class and all the talent is there for him to become a long-term NFL starting tackle.</strong>",
        "tagline_sentence": "",
        "grade": ""
      }
    }
  },
  {
    "title": "Quarterbacks",
    "id": "t.na3j8fb4suzt",
    "archie": {}
  },
  {
    "title": "Running Backs",
    "id": "t.v4p884panzp0",
    "archie": {
      "kaleb-johnson-rb": {
        "background": "Kaleb “K2” Johnson, the oldest of five children, was born and raised in the Cincinnati area by his mother (Juanielle Finley), who gave birth to him at age 17. His maternal grandparents (Charlene and Jeffrey Strader) helped raise him, and Jeffrey served as the main father figure in his life (Johnson: “My grandfather has had the biggest influence on me, because he kept my head straight and always told me to stay positive.”). Johnson’s first passion growing up was baseball (first baseman and left-handed pitcher). He started playing football in kindergarten, initially on the defensive line before switching to running back at age 8 for the Tomahawks. Given his height, some people wanted him to switch positions, but he was determined to stay at running back throughout Pop Warner and middle school —  which is when football took over as his main focus. However, Johnson took a brief hiatus from organized sports in eighth grade when Charlene passed away at age of 62, in June 2017.\nJohnson attended Hamilton High School, where he was a multi-sport standout. As a sophomore, he became part of the running back rotation on varsity (878 yards and nine touchdowns). Johnson led Hamilton to six wins and the Division I state playoffs as a junior, earning first-team All-Conference honors (786 rushing yards and eight touchdowns over 10 games). His most productive season came as a senior captain in 2021, when he carried the ball 155 times for 1,004 yards and 15 touchdowns, earning a first-team All-State spot. Johnson also lettered in basketball and track. He set personal bests of 11.26 seconds in the 100 meters and 22.25 in the 200.\nA three-star recruit, Johnson was the 35th-ranked running back in the 2022 recruiting class and the 15th-ranked recruit in Ohio (No. 2 running back in the state). After his sophomore season, he picked up his first scholarship offer (Iowa State), followed by offers from Cincinnati, Kent State, Michigan State, Pittsburgh, Toledo and Western Michigan. Several teams, including Ohio State, were looking at him as a potential linebacker — his home state Buckeyes never offered. Johnson received an offer from Cal in March 2021 and committed a few months later, in June 2021. However, he visited Iowa for the Hawkeyes’ thrilling 23-20 win over Penn State in October 2021 and flipped his commitment to Iowa a few days later. Johnson was the third-ranked recruit in head coach Kirk Ferentz’s 2022 class. He elected to skip Iowa’s 2024 bowl game and his senior season to enter the 2025 NFL Draft.",
        "strengths": [
          "Physically put-together with power throughout his frame",
          "Runs square with a strong base and forward momentum to make tacklers feel it at contact (draws inspiration from Derrick Henry)",
          "Consistently carries tacklers for extra yards (1,060 rushing yards after contact in 2024)",
          "Processes really well to read backside cuts, follow blocks and navigate holes",
          "Shines on toss, outside zone or plays with horizontal flow",
          "Stays light on his feet to slide, redirect and make timely cuts",
          "Average long speed, but his initial acceleration allows him to get downhill through lanes",
          "Zero fumbles in 2024",
          "Reliable pass catcher with big, strong hands in the screen game",
          "Held up well when asked to pass protect —  and should continue getting better",
          "Stamina runner and looked stronger deep into games (8.3 yards per carry in the fourth quarter in 2024)",
          "Scored at least one touchdown in all 12 regular-season games in ‘24 and set the Iowa record for points in a season",
          "Iowa running backs coach and former NFL player Ladell Betts said Johnson “sets the example” for the offense in terms of how to work"
        ],
        "weaknesses": [
          "Inconsistent pad level through first-level holes",
          "Not a home-run hitter and long speed taps out",
          "Average elusiveness and will struggle to avoid direct hits",
          "Can do a better job setting up second-level moves",
          "Work in progress as a blocker (averaged just 2.4 pass-blocking snaps per game in 2024)",
          "Suffered high-ankle sprain during 2023 fall camp and tried to play through it before missing three games"
        ],
        "full_summary": "A one-year starter at Iowa, Johnson was the focal point of offensive coordinator Tim Lester’s run-heavy, zone-blocking scheme (62.5 percent of Iowa’s snaps in 2024 used multiple tight ends, No. 2 in the FBS). He exploded onto the NFL radar with a prolific 2024 season and set single-season Iowa records for total touchdowns (23), rushing touchdowns (21) and total points scored (138), while becoming just the third player in school history to eclipse 1,500 rushing yards in a season. Despite consistently facing stacked boxes (Iowa ranked 130th out of 133 FBS teams in passing offense in 2024), Johnson shined on outside zone. He is at his best when he can quickly read and set up his blocks and anticipate backside/frontside lanes to find yardage that isn’t there (No. 2 in the FBS with 21 carries of 20-plus yards in 2024). He tends to run upright, giving defenders a large target, but has the build and determination to be a bruiser as a forward-leaning, north-south runner. <strong>Overall, Johnson isn’t a dynamic make-you-miss athlete, but he is a patient and powerful one-cut runner with the instinctive vision to crease the defense using run angles and foot quickness. Though not as loose as Le’Veon Bell, he has a similar run style, with a three-down skill set to thrive in a zone-based NFL scheme. </strong>",
        "tagline_sentence": "",
        "grade": ""
      },
      "omarion-hampton-rb": {
        "background": "Omarion (oh-maNorth r-ee-on) Hampton grew up in Clayton (south of Raleigh) with his mother (Leslie) and father (Cory Chappell). He grew up playing basketball, football and other sports in the neighborhood. At the age of eight, he started playing Pop Warner football and starred for the Cleveland Rams at the mighty mite level. His older brother (Jamal) played wide receiver and defensive back at Cleveland High School and signed with Division-II Chowan in the 2018 recruiting class. His cousin (Giorgio Lowrance) played wide receiver at North Carolina A&amp;T (2006-09).\nHampton enrolled at Cleveland High School and started out on the JV squad before the coaches realized what they had and moved him up to varsity (335 rushing yards and 11 touchdowns). He became the starter as a sophomore and set the school records for rushing yards (2,402), rushing touchdowns (35) and yards per carry (9.61). He earned all-state and conference player of the year honors as Cleveland went 12-2 and won the 2019 conference title. As a junior, Hampton was off to another hot start with 685 yards and 13 touchdowns, but he suffered a broken left ankle in the fifth game, which ended his season. As a senior captain, he returned healthy and rushed for 1,948 yards (12.1 average) and broke his own school-record with 39 rushing touchdowns, earning all-state and conference player of the year honors. Hampton was also named the North Carolina Gatorade Player of the Year as he led Cleveland to an 11-1 record (only loss coming in the playoffs). He finished his prep career with 5,370 rushing yards and 88 rushing touchdowns. Hampton set several weight-lifting records in the school’s program. He also lettered in basketball and track and set personal-bests in the 100-meters (10.71), 200-meters (22.47), long jump (20’9”) and triple jump (38’8”).\nA four-star recruit, Hampton was the No. 11 running back in the 2022 recruiting class and the No. 3 recruit in the state of North Carolina. He received his first offer (Duke) during his breakout sophomore season followed by offers from several ACC (Miami, NC State, Virginia Tech), Big Ten (Michigan, Ohio State, Penn State) and SEC (Auburn, Florida, LSU) programs. After several school visits, Hampton set a final three of Florida, North Carolina and Penn State before deciding to stay home and sign with the Tar Heels. He was the No. 5 ranked recruit in former head coach Mack Brown’s 2022 class. Hampton skipped the 2024 bowl game and his senior season to enter the 2025 NFL Draft.",
        "strengths": [
          "Thick, squared-up build",
          "Above average run strength, especially in his lower half (broke his high school’s squat record as a sophomore)",
          "Tilts the field downhill with the forward lean to barrel through half-tackles",
          "Above average initial burst for a 220-pound athlete",
          "Reads his blocks well at the line of scrimmage to press the hip of his blockers",
          "Subtly sets up defenders before cutting back against the pursuit’s leverage, creating fly-by tackle attempts",
          "Accelerates cleanly off his plant foot to transfer his speed in/out of cuts",
          "Feasted on pivot routes in the UNC offense (two drops on 80 career targets in college)",
          "Transfers the ball to the correct hand to protect against fumbles (only one in 2024)",
          "Proven himself as a durable workhorse (had 25+ touches in eight of 12 games in 2024)",
          "The North Carolina offense requires its back to pass protect and he offers both talent and experience in this area",
          "Finished his career No. 4 in school history in rushing yards (3,565), No. 3 in rushing touchdowns (36), No. 2 in 100-yard rushing games (19)"
        ],
        "weaknesses": [
          "Lack of swivel in his hips creates tightness in his turns, which limits his open-field creativity",
          "Sluggish getting through some of his lateral jump-cuts",
          "Will make himself too big of a target through the line of scrimmage",
          "His pad level needs better consistency to maintain his balance vs. NFL defenders",
          "Willing to power into contact, but not always through it",
          "Stayed healthy in college, but missed most of his junior season in high school with a broken left ankle (March 2021)"
        ],
        "full_summary": "A two-year starter at North Carolina, Hampton was the featured back in former offensive coordinator Chip Lindsey’s balance run attack. He was a beast during the 2023 season and led the ACC in rushing, but it was even more impressive to see him repeat as the conference’s leading rusher in 2024 without Drake Maye and defenses selling out to stop the run (rushed for 100+ yards in 10 of 12 games in 2024 and set a UNC single-season record with 2,033 all-purpose yards). With his NFL-ready frame, Hampton quickly reads the blocking scheme and collects his feet to accelerate through congestion or press-and-cut towards slivers of daylight. Once he gets north-south, he will mash the gas pedal into second-level defenders, but sometimes at the expense of his balance and those heavy hits will take their toll over time. <strong>Overall, Hampton has only average creativity and is a tad tight in his hips and ankles, but he is a bruising runner with an effective blend of patience, power and speed. With his reliability on passing downs, he is a complete player and should start as an NFL rookie.</strong>",
        "tagline_sentence": "",
        "grade": ""
      },
      "rj-harvey-rb": {
        "background": "Robert “RJ” Harvey Jr., who has two sisters (Brianna and Alaina), was born and raised in Orlando with his parents (Robert and Juliet). He grew up with a football in his crib and started playing the first year he was eligible at the age of five. His father was his coach in flag football and then in tackle football for the Orlando Outlaws. Harvey was a quiet kid and his father put him at quarterback to force him to talk more and he stayed at quarterback throughout little league (also played on defense). At the age of seven, Harvey was named the 2008 Offensive Player of the Year in Midget Football. His younger sister (Alaina) was a standout high school softball player and just finished her freshman season as a pitcher and third baseman at Allen University (S.C.).\nHarvey enrolled at Edgewater High School, which produced 2016 first-round safety Karl Joseph. He moved up to varsity as a sophomore and shared the quarterback duties for a team that went winless (0-10) in 2016, losing its games by an average of 41 points per game. Under a new coaching staff, Harvey became the full-time starting quarterback as a junior and led a major turnaround, earning first team all-county and leading Edgewater to a 9-3 record and the 2017 district title. As a senior, he led Edgewater to 12 wins and the 2018 7A state semifinals. Harvey finished his final season with 1,787 passing yards, 1,376 rushing yards and 48 total touchdowns (25 rushing, 23 passing). He also lettered in weightlifting and track at Edgewater with personal-bests in the 100-meters (11.29), 200-meters (23.58) and long jump (18’5”).\nA three-star recruit, Harvey was the No. 36 dual-threat quarterback in the 2019 recruiting class and the No. 216 recruit in the state of Florida. He received interest from colleges as a running back, but he had been a quarterback his entire life and was committed to staying at the position in college. After his junior season, Harvey received his first scholarship offer from South Alabama in February 2018 followed by Appalachian State, Coastal Carolina and Georgia State. Several ACC programs entered the mix, including North Carolina, Syracuse and Virginia. His hometown UCF also offered him, but as a running back. Harvey officially committed to Virginia in July 2018. He signed as a quarterback and was the No. 23 (out of 23) ranked recruit in Virginia’s 2019 class. Harvey was homesick during his redshirt season in Charlottesville and entered the transfer portal in July 2020. The first school he heard from was UCF, who still wanted him as a running back. Harvey was more open to the position change and joined the Golden Knights in August 2020. Because it was so late in the calendar, Harvey had to be a “walk on” with the promise from former head coach Josh Heupel that he would be put on scholarship after the season. Heupel left UCF for the Tennessee head coaching job in January 2021, but kept his promise and put Harvey on scholarship before he left. Harvey took advantage of the extra year of eligibility due to the pandemic and returned to UCF for his sixth season in 2024. He earned AAC All-Academic honors in 2022 and graduated with his degree in interdisciplinary studies (May 2023). He is pursuing a second degree in pre-management. Harvey accepted his invitation to the 2025 Senior Bowl.",
        "strengths": [
          "Patient eyes at the line to settle, scan and allow blockers to do their job",
          "Makes abrupt lateral cuts and his loose lower body helps him hop from one gap to another",
          "Excellent proximity awareness and skillfully maneuvers around all the moving pieces",
          "Elusive burst creates more yardage than expected (his 54 carries of 10+ yards ranked No. 2 in FBS in 2024)",
          "Can spin out of tackle attempts and maintain his balance through contact",
          "Makes sharp cuts in the open-field to disrupt pursuit",
          "Has a solid foundation to become a better pass-catcher",
          "Offers kick return experience, averaging 16.4 yards per return in college (7/115/0)",
          "Consistently productive and finished No. 2 in school history in all-time rushing yards (surpassed 100 yards rushing in 16 of his final 20 games)",
          "Voted a 2024 team captain and described as “lowkey” and “quietly confident” by NFL scouts"
        ],
        "weaknesses": [
          "Average run power and arm tackles can halt his momentum",
          "Guilty of making an extra cut instead of driving downhill when bottled up",
          "Quicker than fast and linebackers can track him down on stretch plays",
          "Squares in pass pro, but too much of a catch-blocker and can be bowled over by blitzers",
          "Sluggish getting his head turned on screen targets for his quarterback (lack of urgency led to a pick-six on the 2024 Utah tape)",
          "Suffered a non-contact ACL tear in his left knee (August 2021) during preseason camp, requiring season-ending surgery in September 2021",
          "Older player and will be 24-years old on draft weekend"
        ],
        "full_summary": "A two-year starter at UCF, Harvey was the lead back in head coach Gus Malzahn’s multiple run scheme. A quarterback his entire life, he never took a snap at running back before joining the Golden Knights (Harvey: “I didn’t even know how to take a handoff.”), but he rushed for 75+ yards in his final 21 games at UCF and only Ashton Jeanty, Omarion Hampton and Tahj Brooks had more rushing yards in the FBS over the last two seasons. While he doesn’t have the power to drive through the first-level, he is a dynamic make-you-miss runner with his tempo and burst, which made him a frequent visitor to the end zone (set the UCF record with 48 total touchdowns). He is below average as a pass-protecting blocker, but has the tools to be a weapon catching the ball on screens and wheels. <strong>Overall, Harvey needs to develop better consistency on passing downs, but he is skilled at patiently settling his feet and changing lanes with his instinctive field vision and lateral quickness. Similar in ways to Tyjae Spears, he projects best in a similar timeshare role in the NFL.</strong>",
        "tagline_sentence": "",
        "grade": ""
      },
      "devin-neal-rb": {
        "background": "Devin Neal, who has a nine-year-old sister (Embree), was born and raised in Lawrence (a few miles from the Kansas campus) with his parents (Ryan and Freda). He was introduced to organized sports in kindergarten and played baseball for the Dirtbags, football for the Eagles and basketball at Lawrence Parks and Recreation. Neal, who grew up idolizing Adrian Peterson, played whatever position put the ball in his hands. He quickly separated himself as one of the best young athletes in youth sports in the area.\nNeal attended Lawrence High School where he continued as a multi-sport standout. After he was part of a 1-8 season as a sophomore, he helped Lawrence to an 8-2 finish as a junior and earned first team all-class and all-league in 2019 with 1,671 rushing yards, 510 receiving yards and 32 touchdowns. As a senior, Neal led the team to a 9-1 record with 1,327 rushing yards and 20 touchdowns, which earned him all-state honors. He also lettered in basketball and baseball. Neal considered graduating early, but after his junior year baseball season was cancelled due to the pandemic, he didn’t want to miss his senior baseball season. He earned second-team all-state honors as an outfielder and led Lawrence to the 2021 regional finals. Neal was also selected to represent team Kansas in Select Baseball.\nA three-star recruit, Neal was the No. 28 running back in the 2021 recruiting class and the No. 1 recruit in the state of Kansas. His first recruiting interest from colleges came in baseball, but football soon took over, including offers from Iowa, Kansas State, Nebraska and Oklahoma State. Several schools were open to him playing both sports, including Princeton, which interested Neal. But his hometown Kansas was always his preferred destination due to his love for his family and roots. The Jayhawks wanted him for baseball too and former head coach Les Miles told Neal that he would be able to play both sports. He signed to play both sports with football being his main focus and baseball being his secondary sport. He was the No. 1 ranked recruit in Miles’ 2021 class. After his freshman season with the football team, Neal joined the baseball team for spring practices and played in seven games that season, reaching base three times (three walks) in six plate appearances. After his sophomore season in football, he decided to give up baseball and focus on football full-time to preserve his body. Neal opted out of the 2024 bowl game and accepted his invitation to the 2025 Senior Bowl.",
        "strengths": [
          "Quality vision to press the line and find creases",
          "Skillfully uses patience and pace to set up defenders and leave them diving at ankles",
          "Strings together moves with his stop-start agility and lateral jukes",
          "Recalibrates on the move to find escape routes",
          "Solidly-built with the run balance to keeps his momentum through arm tackles",
          "Excellent hand-eye coordination as a pass-catcher (played baseball at Kansas)",
          "Productive on swing and wheel routes",
          "Protects the football with only two fumbles over his last 502 carries",
          "Voted a 2024 team captain and both his high school and college coaches are unanimous that he is an “unbelievable” human",
          "Toughs out minor injuries (played in 49 of 50 games the last four seasons)",
          "Became the school’s all-time leading rusher and ranks No. 5 in Big 12 history in career rushing yards"
        ],
        "weaknesses": [
          "Not an inside grinder like his 220-pound frame would suggest",
          "More likely to try and sidestep tackles rather than drop his shoulder and punish them",
          "Average long-speed and doesn’t have a fifth-gear, allowing pursuit to catch him",
          "Overly patient at times and needs to know when to aggressively attack the line of scrimmage",
          "His pass-blocking was too up-and-down (see 2024 Kansas State tape)",
          "Very little special teams experience",
          "Missed one game as a freshman due to a shoulder injury (November 2021)"
        ],
        "full_summary": "A four-year starter at Kansas, Neal was the featured weapon in offensive coordinator Jeff Grimes RPO-based offense with both gap and zone principles. The Lawrence native led the team in rushing all four seasons and achieved legendary status in the program, setting school-records for rushing yards (4,343), rushing touchdowns (49), total touchdowns (53) and 100+ yard rushing games (20). With his square running style, Neal sees the field well and utilizes his patience, loose slides and timing to create mismanaged pursuit angles. While not a burner, he is a great example that throttling speed is more important than sprinting speed at the running back position. <strong>Overall, Neal isn’t a punishing runner, but he consistently creates yardage with his pacing, wiggle and knack for setting up defenders. Although they have very different body types, his skill set is reminiscent of </strong><strong>Kyren Williams</strong><strong>.</strong>",
        "tagline_sentence": "",
        "grade": ""
      },
      "jarquez-hunter-rb": {
        "background": "Jarquez (jar-KWEZ) Hunter, who is one of eight children, grew up on his family’s farm with his grandmother (Shelia Murrell), who played basketball at Jackson State, and mother (Kenyatta Ragsdale) in the small town of Philadelphia in central Mississippi. He also has a relationship with his father (Kenshay Hunter), who lives in Texas. Described as a “country boy,” Hunter played multiple sports throughout his childhood along with riding horses, fishing, hunting and riding four-wheelers (often with his cowboy hat and boots). Hunter, who grew up idolizing Walter Payton, started playing football at the age of six and worked his way from back-up to one of the top youth football players in the area.\nHunter attended Neshoba Central High School where he was a four-year varsity letterman on the football team, playing on offense (running back) and defense (linebacker). His breakout season came as a sophomore when he rushed for 1,986 yards on 231 carries (8.6 average) and 26 touchdowns, adding 81 tackles, 8.0 sacks and two interceptions. As a junior, Hunter led Neshoba Central to a 10-win season and the 2019 regional title. He earned district MVP honors with 2,088 rushing yards (9.8 yards per carry) and 29 touchdowns along with 234 receiving yards and a pair of touchdown grabs. He also had 72 tackles, 10.0 tackles for loss, 7.0 sacks and four interceptions (three returned for touchdowns). As a senior, Hunter rushed for 1,687 yards and 22 touchdowns in just eight games, which earned him the 2020 5A Mr. Football award. He finished his prep career with 5,834 rushing yards and set the Mississippi state record 93 touchdowns, breaking the previous mark of 92 touchdowns held by former Oklahoma, USFL and NFL running back Marcus Dupree, who is also Hunter’s distant cousin. His 93 total touchdowns came six different ways (rushing, receiving, fumble return, interception return, punt return and kick return). Hunter lettered in basketball and track at Neshoba Central and qualified for states as a sophomore with a personal-best in the 100-meters (11.04). As a senior, he also won the 5A power-lifting championship (198-pound weight class) with a 300-pound bench press, 576 squat and 575 deadlift.\nA three-star recruit, Hunter was the No. 43 running back in the 2021 recruiting class and the No. 12 recruit in the state of Mississippi. Following his breakout sophomore season, he received his first scholarship offer from Ole Miss in February 2019. Several schools followed like Louisville, Memphis, Mississippi State, Tennessee and Virginia. Hunter was considered an Ole Miss lean until Auburn, his favorite school from childhood because of Cam Newton, entered the mix late in the process. Newly hired offensive line coach Will Friend, who was also a Neshoba Central alum, convinced the Tigers’ staff to offer Hunter a scholarship a few weeks before signing day. He was the No. 10 ranked recruit in former head coach Bryan Harsin’s first class at Auburn. Hunter made the SEC Academic Honor Roll four straight seasons and graduated (in three years) with his degree in natural resource management (May 2024). He accepted his invitation to the 2025 Senior Bowl.",
        "strengths": [
          "Densely built with bricks and mortar",
          "His teammates tell tales of his legendary weight room work ethic (squatted 600 pounds as a freshman)",
          "Led the SEC with 6.4 yards per carry in 2024",
          "Terrific run balance to drop his pads and keep his feet through contact",
          "Defenders better finish him to the ground because he won’t surrender easily",
          "Hits the burst button when given a lane",
          "Slashing angles leads to chunk runs (his 42 carries of 10+ yards were sixth-most in the 2024 FBS regular season)",
          "Caught the ball well as a screen target",
          "Was a regular on kickoff coverage all four seasons (10 career special teams tackles)",
          "Also has experience returning kicks and averaged 20.7 yards per return (25/517/0)",
          "His rushing production improved each of his four seasons"
        ],
        "weaknesses": [
          "Inconsistent vision working through all the smoke at the line of scrimmage",
          "More likely to barrel into first-level bodies instead of showing extra patience for developing holes",
          "Setting up moves at the second level isn’t natural for him",
          "Struggles to quickly regain his speed after slowed down",
          "Fumbled three times on 187 carries in 2024",
          "Missed assignments in pass pro and his communication needs to be better",
          "Has a projectable frame as a blocker, but blitzing linebackers can give him the shake",
          "Scouts say there are “no concerns” about his character. But he was briefly suspended from the team during the 2023 offseason for allegedly being part of a sex tape video incident"
        ],
        "full_summary": "A two-year starter at Auburn, Hunter was the featured back in head coach Hugh Freeze’s RPO-leaning offense. After backing up Tank Bigsby for two seasons, he led the Tigers in rushing as a junior and senior and leaves The Plains No. 4 on the school’s all-time rushing list (behind Bo Jackson, Cadillac Williams and James Brooks). A weight room demon and state-champion power-lifter in high school, Hunter has a cut-up physique and his physical, balanced run style makes him a chore to tackle. He isn’t the most creative or elusive runner at the line of scrimmage or in space, but he keeps his legs pumping to carry tacklers draped on his back. <strong>Overall, Hunter’s vision and tempo tend to run hot-and-cold, but he is a hammerhead with downhill burst to run through holes and into contact without gearing down. Along with his hungry run style, his impact on special teams will separate him on an NFL running back depth chart.</strong>",
        "tagline_sentence": "",
        "grade": ""
      }
    }
  },
  {
    "title": "Safeties",
    "id": "t.j2g1qftub1sv",
    "archie": {}
  },
  {
    "title": "Specialists",
    "id": "t.6488ecrq2ag4",
    "archie": {}
  },
  {
    "title": "Tight Ends",
    "id": "t.1byrsqk1icg9",
    "archie": {
      "mason-taylor-te": {
        "background": "Mason Taylor, who is the second of three children, was born and raised in South Florida with his parents (Jason and Katina), who divorced in 2015. Jason was a six-time Pro Bowl pass rusher and played 15 seasons in the NFL (1997-2011), primarily with the Miami Dolphins. With 139.5 career sacks, he was inducted into the Pro Football Hall of Fame in 2017. Jason was a defensive coach at St. Thomas Aquinas for five seasons (2017-21) and currently serves as the Miami Hurricanes defensive line coach. Katina is the sister of Jason’s former teammate, Zach Thomas, who was a seven-time Pro Bowl linebacker and inducted into the Pro Football Hall of Fame in 2023. Mason’s aunt (Joy), who is Jason’s sister, is a sports television host for FS1. Both of Mason’s siblings play college sports. His older brother (Isaiah) played safety at Arizona (2021-23) before transferring to Miami for the 2024 season. His younger sister (Zoe) was named the 2023 Miami Beach Volleyball Player of the Year as a senior in high school and signed with the LSU beach volleyball team in 2024. With his father in the NFL, Taylor grew up around the game and in NFL locker rooms. He started his own journey with flag football and then Pop Warner in Davie. Taylor suited up for the Davie Broncos followed by the Davie/Cooper City Colts as part of the American Youth Football (Jason was the Colts’ head coach). Growing up, Taylor attended St. Bonaventure Catholic School in Davie where he played basketball for the Bulldogs.\nTaylor enrolled at St. Thomas Aquinas High School in Fort Lauderdale, a football powerhouse that produced dozens of NFL players, including the Dallas Turner, Nik Bonitto and the Bosa brothers. His older brother and father were also part of the program and Taylor bided his time on a stacked roster, not recording any varsity stats as a freshman or sophomore. As a junior, he played both ways as a tight end and defensive end and helped the team to its second straight 7A state championship in 2020. As a senior, he led St. Thomas Aquinas to a 14-1 record and the 2021 state title, the program’s third straight 7A championship. Taylor finished his final season with 35 receptions for 403 yards and two touchdowns, earning first team all-county honors.\nA three-star recruit, Taylor was the No. 24 tight end in the 2021 recruiting class and the No. 67 recruit in the state of Florida. Despite not yet making an impact on varsity, he picked up his first offer from FIU after his sophomore season in January 2020. His recruitment started to pick up following his junior season as he added full-ride offers from Auburn, Illinois, Miami, Texas A&amp;M and West Virginia. During the summer of 2021, Taylor received offers from Alabama, Florida and LSU and took visits to all three programs. But it was the atmosphere in Baton Rouge and connection to former head coach Ed Orgeron that led him to commit to the Tigers in July 2021. Taylor stayed committed after Orgeron was let go that fall and was the No. 13 ranked recruit in Brian Kelly’s first class at LSU. He twice made the SEC Academic Honor Roll. Taylor elected to skip the 2024 bowl game and his senior season to enter the 2025 NFL Draft.",
        "strengths": [
          "Athletic big-man and still growing into his frame",
          "Dependable hands and naturally adjusts to throws away from his body",
          "His focus doesn’t flinch in traffic",
          "Cleanly frames and catches in stride for quick transitions to a runner",
          "Secures through contact to withstand crushing hits",
          "Runs smooth routes and quickly gets his head turned to make himself available",
          "Strong positional blocker to shield-and-steer",
          "Understands angles and effective as a stalk blocker, especially on the perimeter",
          "Started right away in the SEC and caught a pass in 37 of his 38 career games",
          "Holds the No. 1 (55), No. 3 (38) and No. 4 (36) spots for most catches in a single-season by a tight end in LSU history"
        ],
        "weaknesses": [
          "Shaky base and anchor in pass protection",
          "Too easily bullied or tossed aside by defensive ends, especially when his hands land wide",
          "Found the end zone only once every 21.5 catches at LSU",
          "Follows his blocks well as a ball carrier, but didn’t create much RAC in 2024",
          "Didn’t create many explosive plays (only six of his 55 catches in 2024 went for 20+ yards)",
          "Had false starts on back-to-back snaps on the 2024 UCLA tape (had another one on the 2024 Arkansas tape)",
          "Never recorded a 100-yard receiving game in college",
          "Missed one game as a sophomore and parts of others due to an ankle sprain (September 2023)",
          "Didn’t play on special teams in college"
        ],
        "full_summary": "A three-year starter at LSU, Taylor was a versatile tight end in offensive coordinator Joe Sloan’s pass-happy offense (55.7% inline, 37.0% slot in 2024). Known more as a son of a Pro Football Hall-of-Famer when he enrolled, he made a name for himself by becoming the most productive tight end in LSU history, including the records for career catches (129) and receiving yards (1,308). Despite the records, his single-game high in receiving yards was only 63 yards (vs. Georgia in 2022) in his 22 career SEC starts. Taylor is a loose mover, which shows in his route-running and at the catch point, and he has the hand-eye coordination to make natural adjustments and finish in traffic. In the run game, he is more of a wall-off blocker than violent people-mover, but his toughness and athleticism at the point of attack, especially out in space as a move blocker, help him execute his assignments. <strong>Overall, Taylor was Mr. Reliable in the LSU offense and can be the same for an NFL team due to his good-sized athleticism, reliable ball skills and competitive blocking. He projects as a solid NFL starter who doesn’t have to leave the field and has some similarities to Hunter Henry.</strong>",
        "tagline_sentence": "",
        "grade": ""
      }
    }
  },
  {
    "title": "Wide Receivers",
    "id": "t.fprtust2bolk",
    "archie": {
      "tory-horton-wr": {
        "background": "Tory Horton, the youngest of five children (three boys, two girls), was born and raised in Fresno, Calif., with his parents (Tim and Zezette). His older sister (Jeane) was an All-American volleyball player at UTEP (2009-13) and has played professional volleyball overseas in France, Germany, Italy and Peru. His older brother (Tyler) played cornerback at Boise State (2015-18) and signed with the Miami Dolphins after going undrafted in the 2019 NFL Draft — he left the team during mini-camp to pursue a career in law enforcement. Horton grew up playing several sports, including baseball (his first love), basketball (his father’s favorite sport), football and soccer.\nHorton originally attended Edison High School, where he began on the JV football team before getting the call up to varsity late in his sophomore season. As a junior, he posted 37 receptions for 742 yards (20.1 average) and seven touchdowns, adding a rushing touchdown and passing touchdown to earn second-team All-League honors. For his senior season, Horton transferred to Washington Union and helped the team to an 11-2 record and the 2019 league championship. He caught 37 passes for 821 yards (22.2 average) and 15 touchdowns, earning first-team All-League and conference MVP honors. Horton played defensive back as a senior (29 tackles and four interceptions), and he also lettered in baseball (outfielder and pitcher), basketball and track (jumps and relays).\nA three-star recruit, Horton was the 204th-ranked athlete in the 2020 recruiting class and the No. 263 recruit in California. A late bloomer who played most of his senior year of high school at age 16, Horton was “too skinny” and struggled to get noticed at recruiting camps. He received primarily FCS-level attention with offers from Montana, Montana State and Northern Colorado. He grew up attending Fresno State games, but the Bulldogs never offered. Late in his senior season, Nevada (and lead recruiter Eric Scott) invited him for an official visit and gave him his only FBS offer. After two seasons at Nevada, Horton decided to transfer to Colorado State, following Jay Norvell, who left Nevada to become CSU’s head coach prior to the 2022 season. After a productive season at Colorado State, Horton was recruited by several SEC programs (with NIL opportunities), but he stayed loyal to Norvell and didn’t transfer. He took advantage of the extra year of eligibility granted because of the pandemic and returned to Colorado State for a fifth season.",
        "strengths": [
          "Gliding speed and shows go-and-get-it gear when ball is in the air (22.5 in-game mph)",
          "Can stack/separate vertically or sell double moves",
          "Shows healthy dose of crossers and over routes on film and has a feel for where to fit in coverage",
          "Able to flip his hips towards the ball and make smooth body adjustments or climb the ladder on throws above his line of sight",
          "Can start/stop in a blink to shake defenders after the catch; put more missed tackles on tape than expected",
          "Offers punt-return value (three return TDs at CSU, of 79, 78 and 72 yards); averaged 16.3 yards per return (26/423/3)",
          "Also had a passing touchdown (5-for-6 passing in his career for 151 yards, one TD, one INT)",
          "Two-time team captain (Norvell: “I’ve been around the kid for a long time, and he’s made of the right stuff.”)",
          "Set CSU single-game record for receptions (16, vs. Colorado in 2023) and finished No. 2 in career receiving yards (3,615) both at Colorado State and in the Mountain West Conference"
        ],
        "weaknesses": [
          "Skinny, lean-limbed frame with limited functional strength",
          "Too easily jammed, rerouted and forced off intended path",
          "Rushes as route runner, which leads to drifts and disrupts timing concepts",
          "Has footwork to snap off sharp route breaks, but cheats and rounds too often",
          "Improved drop rate in 2023, but also put some frustrating focus drops on tape (see 2023 Utah State tape)",
          "Struggles to frame and finish on the football with a crowd around him",
          "More double catches than you’d like to see, especially when working over the middle",
          "Willing positional blocker but lacks sustain strength",
          "Despite thin frame, stayed durable most of his career until his final season — missed one game due to a groin strain (September 2024); suffered  season-ending right knee injury (October 2024)"
        ],
        "full_summary": "A two-year starter at Colorado State, Horton was primarily an outside receiver (on the right side of the formation) in Jay Norvell’s version of the Air Raid. After ranking top five in the FBS in catches (96) and first-down grabs (57) in 2023, he returned for his “super senior” season in 2024 but played in just five games because of a right knee injury — and fell 35 receiving yards shy of the Mountain West career record. However, he will continue Colorado State’s impressive run of producing pass-catching draft picks (Trey McBride, Olabisi Johnson, Michael Gallup, Rashard Higgins). Horton is field fast and flashes an explosive gear on downfield and crossing routes (33 combined catches of 20-plus yards over the 2022-23 seasons, seventh most in FBS). His ball skills and route timing can be disrupted by physical defensive backs, but his vertical speed will also open up comebacks, digs and underneath runways. <strong>Overall, Horton must tighten his route running and get stronger, but his fluidity, speed and natural tracking skills can be weaponized by the right coaching staff. He projects as a rotational Z receiver and punt returner who can gradually push for starting flanker reps.</strong>",
        "tagline_sentence": "",
        "grade": ""
      },
      "luther-burden-iii-wr": {
        "background": "Luther Burden III, the only boy of 10 children (eight older sisters, one younger sister), grew up in a neighborhood called “The Ville” in inner-city St. Louis. His mother is Gaye Union. His father (Luther Jr.) was a star guard on the St. Louis University basketball team in the mid-’80s (more than 1,300 career points) and had a cup of coffee with the Indiana Pacers. In May 1987, Luther Jr. was arrested for selling cocaine to an undercover police officer and was sentenced to four years in prison (served 12 months). He now works at a supermarket distribution center (Burden III: “My dad is my best friend.”). At the age of eight, Burden started playing football at the Wohl City Recreation Center. He made such an impact that the coaches at Herbert Hoover Boys &amp; Girls Club asked his parents to work with him. In his first year with the program, he helped lead the team to the league Super Bowl championship as a running back and defensive back (he received the nickname “Touchdown Burden”). From age 9 through middle school, Burden was a standout basketball and football player at Herbert Hoover. He moved to wide receiver in fifth grade.\nBurden originally attended Cardinal Ritter College Prep, a private Catholic high school in St. Louis. As a freshman, he paired with senior wide receiver Jameson Williams (2023 first-round pick of the Detroit Lions) and caught 15 touchdown passes. The duo (Williams calls Burden his “little brother”) led the program to a 16-1 record, its only loss coming in the 2018 Class 3 state championship game. Burden was in the midst of another productive year as a sophomore when the team’s season was cancelled after seven games due to the rostering of an ineligible player (the team’s coaches were fired). In 2020, Cardinal Ritter played an abbreviated fall schedule because of the pandemic — Burden finished with 35 catches for 747 yards and five touchdowns.\nAfter his junior season, Burden transferred to football powerhouse East St. Louis High School in January 2021, primarily so he could graduate early and enroll in college. He finished his three high school seasons at Cardinal Ritter with 124 receptions for 2,941 yards and 39 touchdowns. As a senior, Burden earned All-American and All-State honors and led the team to an 11-3 record and the 2021 6A state championship game (lost to Cary-Grove, 37-36). He was named All-Metro offensive player of the year and finished his final season with 71 catches for 1,174 yards and 20 touchdowns, adding eight punt-return touchdowns and a 54-yard rushing touchdown. Burden also was a top-flight basketball player in middle school and led Cardinal Ritter to the 2019-20 Class 3 state basketball championship as a sophomore. (He didn’t play basketball his final two years of high school.)\nA five-star recruit, Burden was the No. 1-ranked wide receiver in the 2022 recruiting class and the top-ranked recruit in Illinois. He was the No. 3 recruit nationally, behind only athlete Travis Hunter and defensive tackle Walter Nolen. Burden also had double-digit basketball offers, and his coaches believed he could have played professional basketball had he gone that route. Missouri was his first offer in October 2018, and he collected over 20 offers in all before the start of his sophomore year, including from Georgia, LSU, Oregon, Tennessee and USC. Burden narrowed his final to Alabama, Georgia, Missouri, Ohio State and Oklahoma, and he committed to Lincoln Riley and the Sooners in October 2020. He then decommitted in August 2021 and, two months later, officially announced he would be staying close to home to play for head coach Eli Drinkwitz and Missouri. He was the No. 1 recruit in the Tigers’ 2022 class and became just the third consensus five-star recruit in program history. Burden opted out of Missouri’s 2024 bowl game and skipped his senior season to enter the 2025 NFL Draft.",
        "strengths": [
          "Above-average foot speed for a 210-pounder",
          "Dangerous with the ball in his hands and runs with the physicality and contact balance of a running back",
          "Lined up in the backfield and threatened defenses with jet-sweep options",
          "Saw high volume of quick targets and runway routes to give him catch-and-run chances (7.3 career YAC per reception)",
          "Outstanding lower-body agility to redirect and burst in another direction",
          "Has ability to stop on a dime and leave defenders falling over themselves (78 career forced missed tackles)",
          "Strong concentration and control at catch point",
          "Tracks well over his shoulder to coast underneath the pass",
          "Doesn’t appear bothered with crowded air space downfield",
          "Flashes play strength to fight through contact and back to the ball",
          "Averaged 10.5 yards per punt return in his career (23/242/1), with a 78-yard touchdown as a freshman",
          "Caught a pass in 34 straight games, the second-longest streak in school history",
          "Didn’t miss a game due to injury in his three college seasons",
          "Finished No. 4 in Missouri history in career catches (192)"
        ],
        "weaknesses": [
          "Just 10 catches of 20-plus yards in 2024 ( 110th in FBS)",
          "Upright route running gives defenders a clear target to redirect or latch on to",
          "Needs to clean up footwork for better snap at the top of routes",
          "Looks disinterested on some routes",
          "Fumbled against Boston College in 2024 and muffed one punt in each of his three college seasons",
          "More of a get-in-the-way blocker and doesn’t consistently latch and control defenders",
          "Two frustrating 15-yard penalties on 2024 Boston College tape, including one for throwing an opponent’s mouthguard in frustration (Burden: “I have to cut the nonsense out.”)",
          "Below-average production in 2024"
        ],
        "full_summary": "A three-year starter at Missouri, Burden was predominantly a slot receiver in offensive coordinator Kirby Moore’s motion-heavy scheme (85.3 percent of his 2024 snaps came in the slot). With only one 100-yard receiving performance in 2024, he wasn’t able to build on his All-America sophomore season as the entire Missouri offense struggled, but there were enough flashes to tease his high-level talent. With his run-after-catch skills, Burden saw a high volume of quick-hitters and crossers, which showcased his any-direction burst and physicality to give defenders the shake. His route running is best described as a “work in progress” right now, but he appears unfazed when forced to flip his body and track/adjust to errant throws. <strong>Overall, Burden is still working on his undergrad degree in route setup and separation, but he holds a master’s in creating with the ball in his hands, because of his explosive speed and competitive toughness. For an NFL team targeting a YAC weapon with upside to be more, he will be an appealing option early.</strong>",
        "tagline_sentence": "",
        "grade": ""
      }
    }
  }
]